RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_clk.c
/**
 *******************************************************************************
 * @file  hc32_ll_clk.c
 * @brief This file provides firmware functions to manage the Clock(CLK).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-03-31       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_clk.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_CLK CLK
 * @brief Clock Driver Library
 * @{
 */

#if (LL_CLK_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup CLK_Local_Macros CLK Local Macros
 * @{
 */

/**
 * @brief CLK_FREQ Clock frequency definition
 */
#define CLK_FREQ_48M                        (48UL*1000UL*1000UL)
#define CLK_FREQ_64M                        (64UL*1000UL*1000UL)
#define CLK_FREQ_32M                        (32UL*1000UL*1000UL)

/**
 * @brief Be able to modify TIMEOUT according to board condition.
 */
#define CLK_TIMEOUT                         ((uint32_t)0x1000UL)
#define CLK_LRC_TIMEOUT                     ((uint32_t)0x200U)

#define CLK_MRC_TIMEOUT                     ((uint32_t)0x200U)
#define CLK_XTAL32_TIMEOUT                  ((uint32_t)0x200U)

/**
 * @brief LRC State ON or OFF
 */
#define CLK_LRC_OFF                         (CMU_LRCCR_LRCSTP)
#define CLK_LRC_ON                          (0x00U)

/**
 * @brief MRC State ON or OFF
 */
#define CLK_MRC_OFF                         (CMU_MRCCR_MRCSTP)
#define CLK_MRC_ON                          (0x80U)

/**
 * @brief Clk PLL Relevant Parameter Range Definition
 */
#define CLK_PLLP_DEFAULT                    (0x01UL)
#define CLK_PLLQ_DEFAULT                    (0x01UL)
#define CLK_PLLR_DEFAULT                    (0x01UL)
#define CLK_PLLN_DEFAULT                    (0x13UL)
#define CLK_PLLM_DEFAULT                    (0x00UL)

#define CLK_PLLR_DIV_MIN                    (2UL)
#define CLK_PLLR_DIV_MAX                    (16UL)
#define CLK_PLLQ_DIV_MIN                    (2UL)
#define CLK_PLLQ_DIV_MAX                    (16UL)
#define CLK_PLLP_DIV_MIN                    (2UL)
#define CLK_PLLP_DIV_MAX                    (16UL)

#define CLK_PLLX_FREQ_MIN                   (15UL*1000UL*1000UL)
#define CLK_PLLX_VCO_IN_MIN                 (1UL*1000UL*1000UL)
#define CLK_PLLX_VCO_IN_MAX                 (25UL*1000UL*1000UL)
#define CLK_PLLX_VCO_OUT_MIN                (240UL*1000UL*1000UL)
#define CLK_PLLX_VCO_OUT_MAX                (480UL*1000UL*1000UL)
#define CLK_PLLXM_DIV_MIN                   (2UL)
#define CLK_PLLXM_DIV_MAX                   (24UL)
#define CLK_PLLXN_MULTI_MIN                 (20UL)
#define CLK_PLLXN_MULTI_MAX                 (480UL)
#define CLK_PLLXR_DIV_MIN                   (2UL)
#define CLK_PLLXR_DIV_MAX                   (16UL)
#define CLK_PLLXQ_DIV_MIN                   (2UL)
#define CLK_PLLXQ_DIV_MAX                   (16UL)
#define CLK_PLLXP_DIV_MIN                   (2UL)
#define CLK_PLLXP_DIV_MAX                   (16UL)
#define CLK_PLLXP_DEFAULT                   (0x01UL)
#define CLK_PLLXQ_DEFAULT                   (0x01UL)
#define CLK_PLLXR_DEFAULT                   (0x01UL)
#define CLK_PLLXN_DEFAULT                   (0x13UL)
#define CLK_PLLXM_DEFAULT                   (0x00UL)

#define CLK_PLL_FREQ_MIN                    (15UL*1000UL*1000UL)
#define CLK_PLL_VCO_IN_MIN                  (1UL*1000UL*1000UL)
#define CLK_PLL_VCO_IN_MAX                  (25UL*1000UL*1000UL)
#define CLK_PLL_VCO_OUT_MIN                 (240UL*1000UL*1000UL)
#define CLK_PLL_VCO_OUT_MAX                 (480UL*1000UL*1000UL)
#define CLK_PLLM_DIV_MIN                    (1UL)
#define CLK_PLLM_DIV_MAX                    (24UL)
#define CLK_PLLN_MULTI_MIN                  (20UL)
#define CLK_PLLN_MULTI_MAX                  (480UL)
#define CLK_PLLX_FREQ_MAX                   (200UL*1000UL*1000UL)
#define CLK_PLL_FREQ_MAX                    (240UL*1000UL*1000UL)

/**
 * @brief Clk PLL Register Redefinition
 */
#define PLL_SRC_REG                         (CM_CMU->PLLCFGR)
#define PLL_SRC_BIT                         (CMU_PLLCFGR_PLLSRC)
#define PLL_SRC_POS                         (CMU_PLLCFGR_PLLSRC_POS)
#define PLL_SRC                             ((CM_CMU->PLLCFGR & CMU_PLLCFGR_PLLSRC) >> CMU_PLLCFGR_PLLSRC_POS)
#define PLL_EN_REG                          (CM_CMU->PLLCR)
#define PLLX_EN_REG                         (CM_CMU->UPLLCR)

/**
 * @brief Switch clock stable time
 * @note Approx. 30us
 */
#define CLK_SYSCLK_SW_STB                   (HCLK_VALUE / 50000UL)

/**
 * @brief Clk FCG Default Value
 */
#define CLK_FCG0_DEFAULT                    (0xFFFFFA0EUL)
#define CLK_FCG1_DEFAULT                    (0xFFFFFFFFUL)
#define CLK_FCG2_DEFAULT                    (0xFFFFFFFFUL)
#define CLK_FCG3_DEFAULT                    (0xFFFFFFFFUL)

/**
 * @defgroup CLK_Check_Parameters_Validity CLK Check Parameters Validity
 * @{
 */
/* Check CLK register lock status. */
#define IS_CLK_UNLOCKED()                   ((CM_PWC->FPRC & PWC_FPRC_FPRCB0) == PWC_FPRC_FPRCB0)

/* Parameter valid check for XTAL state */
#define IS_CLK_XTAL_STATE(x)                                                   \
(   ((x) == CLK_XTAL_OFF)                         ||                           \
    ((x) == CLK_XTAL_ON))

