RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_clk.c
/* Parameter valid check for XTAL mode */
#define IS_CLK_XTAL_MD(x)                                                      \
(   ((x) == CLK_XTAL_MD_OSC)                      ||                           \
    ((x) == CLK_XTAL_MD_EXCLK))

/* Parameter valid check for XTAL super drive state */
#define IS_CLK_XTAL_SUPDRV_STATE(x)                                            \
(   ((x) == CLK_XTAL_SUPDRV_ON)                   ||                           \
    ((x) == CLK_XTAL_SUPDRV_OFF))

/* Parameter valid check for XTAL driver ability mode */
#define IS_CLK_XTAL_DRV_MD(x)                                                  \
(   ((x) == CLK_XTAL_DRV_HIGH)                    ||                           \
    ((x) == CLK_XTAL_DRV_MID)                     ||                           \
    ((x) == CLK_XTAL_DRV_LOW)                     ||                           \
    ((x) == CLK_XTAL_DRV_ULOW))

/* Parameter valid check for XTAL stable time selection */
#define IS_CLK_XTAL_STB_SEL(x)                                                 \
(   ((x) == CLK_XTAL_STB_133US)                   ||                           \
    ((x) == CLK_XTAL_STB_255US)                   ||                           \
    ((x) == CLK_XTAL_STB_499US)                   ||                           \
    ((x) == CLK_XTAL_STB_988US)                   ||                           \
    ((x) == CLK_XTAL_STB_2MS)                     ||                           \
    ((x) == CLK_XTAL_STB_4MS)                     ||                           \
    ((x) == CLK_XTAL_STB_8MS)                     ||                           \
    ((x) == CLK_XTAL_STB_16MS)                    ||                           \
    ((x) == CLK_XTAL_STB_31MS))

/* Parameter valid check for XTALSTD state */
#define IS_CLK_XTALSTD_STATE(x)                                                \
(   ((x) == CLK_XTALSTD_OFF)                      ||                           \
    ((x) == CLK_XTALSTD_ON))

/* Parameter valid check for XTALSTD mode */
#define IS_CLK_XTALSTD_MD(x)                                                   \
(   ((x) == CLK_XTALSTD_MD_RST)                   ||                           \
    ((x) == CLK_XTALSTD_MD_INT))

/* Parameter valid check for XTALSTD interrupt state */
#define IS_CLK_XTALSTD_INT_STATE(x)                                            \
(   ((x) == CLK_XTALSTD_INT_OFF)                  ||                           \
    ((x) == CLK_XTALSTD_INT_ON))

/* Parameter valid check for XTALSTD reset state */
#define IS_CLK_XTALSTD_RST_STATE(x)                                            \
(   ((x) == CLK_XTALSTD_RST_OFF)                  ||                           \
    ((x) == CLK_XTALSTD_RST_ON))

/* Parameter valid check for PLL state */
#define IS_CLK_PLL_STATE(x)                                                    \
(   ((x) == CLK_PLL_OFF)                          ||                           \
    ((x) == CLK_PLL_ON))

/* Parameter validity check for PLL input source */
#define IS_CLK_PLL_SRC(x)                                                      \
(   ((x) == CLK_PLL_SRC_XTAL)                     ||                           \
    ((x) == CLK_PLL_SRC_HRC))

/* Parameter validity check for PLL frequency range */
#define IS_CLK_PLL_FREQ(x)                                                     \
(   ((x) <= CLK_PLL_FREQ_MAX)                     &&                           \
    ((x) >= CLK_PLL_FREQ_MIN))

/* Parameter validity check for PLL M divide */
#define IS_CLK_PLLM_DIV(x)                                                     \
(   ((x) <= CLK_PLLM_DIV_MAX)                     &&                           \
    ((x) >= CLK_PLLM_DIV_MIN))

/* Parameter validity check for PLL N multi- */
#define IS_CLK_PLLN_MULTI(x)                                                   \
(   ((x) <= CLK_PLLN_MULTI_MAX)                   &&                           \
    ((x) >= CLK_PLLN_MULTI_MIN))

/* Parameter validity check for PLL P divide */
#define IS_CLK_PLLP_DIV(x)                                                     \
(   ((x) <= CLK_PLLP_DIV_MAX)                     &&                           \
    ((x) >= CLK_PLLP_DIV_MIN))

/* Parameter validity check for PLL_input freq./PLLM(vco_in) */
#define IS_CLK_PLL_VCO_IN(x)                                                   \
(   ((x) <= CLK_PLL_VCO_IN_MAX)                   &&                           \
    ((x) >= CLK_PLL_VCO_IN_MIN))

/* Parameter validity check for PLL vco_in*PLLN(vco_out) */
#define IS_CLK_PLL_VCO_OUT(x)                                                  \
(   ((x) <= CLK_PLL_VCO_OUT_MAX)                  &&                           \
    ((x) >= CLK_PLL_VCO_OUT_MIN))

/* Parameter validity check for PLL R divide */
#define IS_CLK_PLLR_DIV(x)                                                     \
(   ((x) <= CLK_PLLR_DIV_MAX)                     &&                           \
    ((x) >= CLK_PLLR_DIV_MIN))

/* Parameter validity check for PLL Q divede */
#define IS_CLK_PLLQ_DIV(x)                                                     \
(   ((x) <= CLK_PLLQ_DIV_MAX)                     &&                           \
    ((x) >= CLK_PLLQ_DIV_MIN))

/* Parameter valid check for PLLX state */
#define IS_CLK_PLLX_STATE(x)                                                   \
(   ((x) == CLK_PLLX_OFF)                         ||                           \
    ((x) == CLK_PLLX_ON))

/* Parameter validity check for PLLX frequency range */
#define IS_CLK_PLLX_FREQ(x)                                                    \
(   (CLK_PLLX_FREQ_MIN <= (x))                    &&                           \
    (CLK_PLLX_FREQ_MAX >= (x)))

/* Parameter validity check for PLLX M divide */
#define IS_CLK_PLLXM_DIV(x)                                                    \
(   (CLK_PLLXM_DIV_MIN <= (x))                    &&                           \
    (CLK_PLLXM_DIV_MAX >= (x)))

/* Parameter validity check for PLLX N multi- */
#define IS_CLK_PLLXN_MULTI(x)                                                  \
(   (CLK_PLLXN_MULTI_MIN <= (x))                  &&                           \
    (CLK_PLLXN_MULTI_MAX >= (x)))

/* Parameter validity check for PLLX R divide */
#define IS_CLK_PLLXR_DIV(x)                                                    \
(   (CLK_PLLXR_DIV_MIN <= (x))                    &&                           \
    (CLK_PLLXR_DIV_MAX >= (x)))

/* Parameter validity check for PLLX Q divede */
#define IS_CLK_PLLXQ_DIV(x)                                                    \
(   (CLK_PLLXQ_DIV_MIN <= (x))                    &&                           \
    (CLK_PLLXQ_DIV_MAX >= (x)))

/* Parameter validity check for PLLX P divide */
#define IS_CLK_PLLXP_DIV(x)                                                    \
(   (CLK_PLLXP_DIV_MIN <= (x))                    &&                           \
    (CLK_PLLXP_DIV_MAX >= (x)))

